# SetRenameOnSlowDoubleClickInProjectBrowser Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DoubleClickOptions..::..SetRenameOnSlowDoubleClickInProjectBrowser Method
DoubleClickOptions Class See Also
---
Sets whether the desired action is to rename item in project browser on slow double-click.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void SetRenameOnSlowDoubleClickInProjectBrowser(
	bool bRenameOnSlowDoubleClickInProjectBrowser
)
```

Visual Basic
---
```text
Public Sub SetRenameOnSlowDoubleClickInProjectBrowser ( _
	bRenameOnSlowDoubleClickInProjectBrowser As Boolean _
)
```

Visual C++
---
```text
public:
void SetRenameOnSlowDoubleClickInProjectBrowser(
	bool bRenameOnSlowDoubleClickInProjectBrowser
)
```

# ### Parameters
bRenameOnSlowDoubleClickInProjectBrowser
    Type: System..::..Boolean
# See Also
DoubleClickOptions Class
Autodesk.Revit.UI Namespace